tutorials/validation/SIPM-SP/caseB/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication -l log.blockMesh.solid blockMesh -region solid
runApplication -l log.setSet.solid setSet -region solid -batch solid.setSet
runApplication -l log.setsToZones.solid setsToZones -region solid -noFlipMap

runApplication blockMesh -region cavity
runApplication setSet -region cavity -batch fluid.setSet
runApplication setsToZones -region cavity -noFlipMap

runApplication multiChtFoam

source postProcessDsip

runApplication -l log.sample.cavity sample -region cavity 
runApplication -l log.sample.solid sample -region solid 

cat sets/cavity/0.07/TatYLine_T.xy >>  TatYLine_T.xy
cat sets/solid/0.07/TatYLine_T.xy >>  TatYLine_T.xy

# ----------------------------------------------------------------- end-of-file

